[Survived] StringLiteral
src/components/layout/Layout.tsx:58:76
     <Container fluid className="px-0">
       <Row noGutters>
         <Col className="footer-col">
-          <footer className={transparentNavFooter ? "transparent-footer" : ""}>
+          <footer className={transparentNavFooter ? "transparent-footer" : "Stryker was here!"}>
             <span>
               Copyright © 2006

[Survived] StringLiteral
src/components/layout/Layout.tsx:58:53
     <Container fluid className="px-0">
       <Row noGutters>
         <Col className="footer-col">
-          <footer className={transparentNavFooter ? "transparent-footer" : ""}>
+          <footer className={transparentNavFooter ? "" : ""}>
             <span>
               Copyright © 2006

[Survived] EqualityOperator
src/components/layout/Layout.tsx:61:41
           <footer className={transparentNavFooter ? "transparent-footer" : ""}>
             <span>
               Copyright © 2006
-              {new Date().getFullYear() > 2006
+              {new Date().getFullYear() <= 2006
                 ? "-" + new Date().getFullYear()
                 : ""}{" "}
