[Survived] StringLiteral
src/pages/account/login.tsx:8:44
 import firebase from "gatsby-plugin-firebase"
 
 const LoginPage = (): ReactElement => {
-  const [email, setEmail] = React.useState("")
+  const [email, setEmail] = React.useState("Stryker was here!")
   const [password, setPassword] = React.useState("")
   const handleSubmit = (): void => {

[Survived] BlockStatement
src/pages/account/login.tsx:10:36
 const LoginPage = (): ReactElement => {
   const [email, setEmail] = React.useState("")
   const [password, setPassword] = React.useState("")
-  const handleSubmit = (): void => {
-    firebase
-      .auth()
-      .signInWithEmailAndPassword(email, password)
-      .then(() => console.log("done"))
-      .catch(e => console.log(e))
-  }
+  const handleSubmit = (): void => {}
   return (
     <Layout>

[Survived] ArrowFunction
src/pages/account/login.tsx:14:13
     firebase
       .auth()
       .signInWithEmailAndPassword(email, password)
-      .then(() => console.log("done"))
+      .then(() => undefined)
       .catch(e => console.log(e))
   }

[Survived] ArrowFunction
src/pages/account/login.tsx:15:14
       .auth()
       .signInWithEmailAndPassword(email, password)
       .then(() => console.log("done"))
-      .catch(e => console.log(e))
+      .catch(() => undefined)
   }
   return (

[Survived] ArrowFunction
src/pages/account/login.tsx:21:23
     <Layout>
       <SEO title="Login" />
       <h1>Login</h1>
-      <Form onSubmit={(e): void => e.preventDefault()}>
+      <Form onSubmit={() => undefined}>
         <Form.Group controlId="authEmail">
           <Form.Label>Email address</Form.Label>

[Survived] ArrowFunction
src/pages/account/login.tsx:28:23
             type="email"
             placeholder="Enter your email..."
             value={email}
-            onChange={(e): void => setEmail(e.target.value)}
+            onChange={() => undefined}
           />
           <Form.Control.Feedback className="text-muted">

[Survived] ArrowFunction
src/pages/account/login.tsx:40:23
             type="password"
             placeholder="Enter your password..."
             value={password}
-            onChange={(e): void => setPassword(e.target.value)}
+            onChange={() => undefined}
           />
           <Form.Control.Feedback className="text-muted">
