[Survived] BlockStatement
src/components/layout/Navbar.tsx:22:18
    * Whether the link should be a dropdown link
    */
   dropdown?: boolean
-}): ReactElement {
-  // Gatsby link element doesn't work well with our storybook config
-  const linkProps = {
-    eventKey: props.page,
-    onClick: (): void => {
-      navigate("/" + props.page)
-    },
-  }
-  if (props.dropdown) {
-    return (
-      <>
-        <NavDropdown.Item {...linkProps}>{props.children}</NavDropdown.Item>
-      </>
-    )
-  } else {
-    return (
-      <Nav.Item>
-        <Nav.Link {...linkProps}>{props.children}</Nav.Link>
-      </Nav.Item>
-    )
-  }
-}
+}): ReactElement {}
 
 const AuthDropdown = (): ReactElement => {

[Survived] BlockStatement
src/components/layout/Navbar.tsx:26:26
   // Gatsby link element doesn't work well with our storybook config
   const linkProps = {
     eventKey: props.page,
-    onClick: (): void => {
-      navigate("/" + props.page)
-    },
+    onClick: (): void => {},
   }
   if (props.dropdown) {

[Survived] ArithmeticOperator
src/components/layout/Navbar.tsx:27:20
   const linkProps = {
     eventKey: props.page,
     onClick: (): void => {
-      navigate("/" + props.page)
+      navigate("/" - props.page)
     },
   }

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:30:7
       navigate("/" + props.page)
     },
   }
-  if (props.dropdown) {
+  if (false) {
     return (
       <>

[Survived] BlockStatement
src/components/layout/Navbar.tsx:30:23
       navigate("/" + props.page)
     },
   }
-  if (props.dropdown) {
-    return (
-      <>
-        <NavDropdown.Item {...linkProps}>{props.children}</NavDropdown.Item>
-      </>
-    )
-  } else {
+  if (props.dropdown) {} else {
     return (
       <Nav.Item>

[Survived] BlockStatement
src/components/layout/Navbar.tsx:36:10
         <NavDropdown.Item {...linkProps}>{props.children}</NavDropdown.Item>
       </>
     )
-  } else {
-    return (
-      <Nav.Item>
-        <Nav.Link {...linkProps}>{props.children}</Nav.Link>
-      </Nav.Item>
-    )
-  }
+  } else {}
 }
 

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:48:7
 const AuthDropdown = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
 
-  if (loading) {
+  if (true) {
     return (
       <NavDropdown id={"authDropdown"} title={"Loading..."} alignRight>

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:48:7
 const AuthDropdown = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
 
-  if (loading) {
+  if (false) {
     return (
       <NavDropdown id={"authDropdown"} title={"Loading..."} alignRight>

[Survived] StringLiteral
src/components/layout/Navbar.tsx:50:47
 
   if (loading) {
     return (
-      <NavDropdown id={"authDropdown"} title={"Loading..."} alignRight>
+      <NavDropdown id={"authDropdown"} title={""} alignRight>
         <NavDropdown.Header>Loading...</NavDropdown.Header>
       </NavDropdown>

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:55:7
       </NavDropdown>
     )
   }
-  if (user) {
+  if (true) {
     return (
       <NavDropdown

[Survived] BlockStatement
src/components/layout/Navbar.tsx:55:13
       </NavDropdown>
     )
   }
-  if (user) {
-    return (
-      <NavDropdown
-        id={"authDropdown"}
-        title={`Hello, ${user.displayName || user.email}`}
-        alignRight
-      >
-        <NavDropdown.Header>
-          You are logged in as <b>{user.displayName || user.email}</b>
-        </NavDropdown.Header>
-        <NavbarLink page="/account" dropdown>
-          Account Settings
-        </NavbarLink>
-        <NavDropdown.Divider />
-        <NavbarLink page="/account/logout" dropdown>
-          Logout
-        </NavbarLink>
-      </NavDropdown>
-    )
-  }
+  if (user) {}
   if (error) {
     return (

[Survived] LogicalOperator
src/components/layout/Navbar.tsx:59:43
     return (
       <NavDropdown
         id={"authDropdown"}
-        title={`Hello, ${user.displayName || user.email}`}
+        title={`Hello, ${user.displayName && user.email}`}
         alignRight
       >

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:59:26
     return (
       <NavDropdown
         id={"authDropdown"}
-        title={`Hello, ${user.displayName || user.email}`}
+        title={`Hello, ${false}`}
         alignRight
       >

[Survived] LogicalOperator
src/components/layout/Navbar.tsx:63:53
         alignRight
       >
         <NavDropdown.Header>
-          You are logged in as <b>{user.displayName || user.email}</b>
+          You are logged in as <b>{user.displayName && user.email}</b>
         </NavDropdown.Header>
         <NavbarLink page="/account" dropdown>

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:63:36
         alignRight
       >
         <NavDropdown.Header>
-          You are logged in as <b>{user.displayName || user.email}</b>
+          You are logged in as <b>{false}</b>
         </NavDropdown.Header>
         <NavbarLink page="/account" dropdown>

[Survived] ConditionalExpression
src/components/layout/Navbar.tsx:75:7
       </NavDropdown>
     )
   }
-  if (error) {
+  if (false) {
     return (
       <NavDropdown id={"authDropdown"} title={"Account"} alignRight>

[Survived] BlockStatement
src/components/layout/Navbar.tsx:75:14
       </NavDropdown>
     )
   }
-  if (error) {
-    return (
-      <NavDropdown id={"authDropdown"} title={"Account"} alignRight>
-        <NavDropdown.Header>
-          There was an error logging you in: error.code
-        </NavDropdown.Header>
-        <NavbarLink page="/account" dropdown>
-          Login Again
-        </NavbarLink>
-      </NavDropdown>
-    )
-  }
+  if (error) {}
   return (
     // <NavDropdown id={"authDropdown"} title={"NLI"} alignRight>

[Survived] StringLiteral
src/components/layout/Navbar.tsx:77:47
   }
   if (error) {
     return (
-      <NavDropdown id={"authDropdown"} title={"Account"} alignRight>
+      <NavDropdown id={"authDropdown"} title={""} alignRight>
         <NavDropdown.Header>
           There was an error logging you in: error.code

[Survived] StringLiteral
src/components/layout/Navbar.tsx:77:24
   }
   if (error) {
     return (
-      <NavDropdown id={"authDropdown"} title={"Account"} alignRight>
+      <NavDropdown id={""} title={"Account"} alignRight>
         <NavDropdown.Header>
           There was an error logging you in: error.code

[Survived] StringLiteral
src/components/layout/Navbar.tsx:123:57
         variant="dark"
         expand="lg"
         id="site-navbar"
-        className={transparent ? "transparent-navbar" : ""}
+        className={transparent ? "transparent-navbar" : "Stryker was here!"}
       >
         {/* <Container> */}

[Survived] StringLiteral
src/components/layout/Navbar.tsx:123:34
         variant="dark"
         expand="lg"
         id="site-navbar"
-        className={transparent ? "transparent-navbar" : ""}
+        className={transparent ? "" : ""}
       >
         {/* <Container> */}

[Survived] StringLiteral
src/components/layout/Navbar.tsx:129:44
         <Link to="/" className="link-no-style">
           <BootstrapNavbar.Brand as="span">
             BSA Troop 485{" "}
-            {admin ? <span style={{ color: "#99ccff" }}>| Admin</span> : <></>}
+            {admin ? <span style={{ color: "" }}>| Admin</span> : <></>}
           </BootstrapNavbar.Brand>
         </Link>
