[Killed] LogicalOperator
src/components/voting/VotingGroup.tsx:59:20
   return (
     <div>
       {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
-      {description && (
+      {description || (
         <p className="text-muted mb-2 mt-1 votingGroupDescription">
           {description}

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:59:8
   return (
     <div>
       {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
-      {description && (
-        <p className="text-muted mb-2 mt-1 votingGroupDescription">
-          {description}
-        </p>
-      )}
+      {false}
       {maxVotes && (
         <p

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:64:8
           {description}
         </p>
       )}
-      {maxVotes && (
-        <p
-          className={classNames(
-            "mt-2 mb-1 votingGroupMaxVotes",
-            (value || []).length > maxVotes ? "text-danger" : "text-muted"
-          )}
-        >
-          {(value || []).length} of {maxVotes} votes used. You are not required
-          to use all your votes.
-        </p>
-      )}
+      {true}
       {options.map((opt, i) => {
         const checked = value?.indexOf(opt.value) > -1

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:64:8
           {description}
         </p>
       )}
-      {maxVotes && (
-        <p
-          className={classNames(
-            "mt-2 mb-1 votingGroupMaxVotes",
-            (value || []).length > maxVotes ? "text-danger" : "text-muted"
-          )}
-        >
-          {(value || []).length} of {maxVotes} votes used. You are not required
-          to use all your votes.
-        </p>
-      )}
+      {false}
       {options.map((opt, i) => {
         const checked = value?.indexOf(opt.value) > -1

[Killed] StringLiteral
src/components/voting/VotingGroup.tsx:67:13
       {maxVotes && (
         <p
           className={classNames(
-            "mt-2 mb-1 votingGroupMaxVotes",
+            "",
             (value || []).length > maxVotes ? "text-danger" : "text-muted"
           )}

[Killed] LogicalOperator
src/components/voting/VotingGroup.tsx:68:20
         <p
           className={classNames(
             "mt-2 mb-1 votingGroupMaxVotes",
-            (value || []).length > maxVotes ? "text-danger" : "text-muted"
+            (value && []).length > maxVotes ? "text-danger" : "text-muted"
           )}
         >

[Killed] EqualityOperator
src/components/voting/VotingGroup.tsx:68:34
         <p
           className={classNames(
             "mt-2 mb-1 votingGroupMaxVotes",
-            (value || []).length > maxVotes ? "text-danger" : "text-muted"
+            (value || []).length >= maxVotes ? "text-danger" : "text-muted"
           )}
         >

[Killed] LogicalOperator
src/components/voting/VotingGroup.tsx:71:19
             (value || []).length > maxVotes ? "text-danger" : "text-muted"
           )}
         >
-          {(value || []).length} of {maxVotes} votes used. You are not required
+          {(value && []).length} of {maxVotes} votes used. You are not required
           to use all your votes.
         </p>

[Killed] BlockStatement
src/components/voting/VotingGroup.tsx:75:32
           to use all your votes.
         </p>
       )}
-      {options.map((opt, i) => {
-        const checked = value?.indexOf(opt.value) > -1
-        return (
-          <Form.Check
-            key={i}
-            custom
-            id={`check-${i}-${typeof opt.value}-${opt.value}`} // required for react bootstrap
-            label={opt.label}
-            checked={checked}
-            onChange={(): void => onSelectChange(opt.value, !checked)}
-          />
-        )
-      })}
+      {options.map((opt, i) => {})}
     </div>
   )

[Killed] UnaryOperator
src/components/voting/VotingGroup.tsx:76:53
         </p>
       )}
       {options.map((opt, i) => {
-        const checked = value?.indexOf(opt.value) > -1
+        const checked = value?.indexOf(opt.value) > +1
         return (
           <Form.Check

[Killed] StringLiteral
src/components/voting/VotingGroup.tsx:81:17
           <Form.Check
             key={i}
             custom
-            id={`check-${i}-${typeof opt.value}-${opt.value}`} // required for react bootstrap
+            id={""} // required for react bootstrap
             label={opt.label}
             checked={checked}
