[Survived] BlockStatement
t485/src/pages/account.tsx:9:51
 import firebase from "gatsby-plugin-firebase"
 import { Button, Form, Table } from "react-bootstrap"
 
-const UpdateDisplayNameForm = (): ReactElement => {
-  const [user, loading, error] = useAuthState(firebase.auth())
-  const [name, setName] = React.useState(user?.displayName || "Loading...")
-  if (!user) return <></>
-
-  const handleSubmit = (): void => {
-    user
-      .updateProfile({
-        displayName: name,
-        // photoURL: "https://example.com/jane-q-user/profile.jpg"
-      })
-      .then(function() {
-        console.log("DONE")
-      })
-      .catch(function(error) {
-        console.log(error)
-      })
-  }
-}
+const UpdateDisplayNameForm = (): ReactElement => {}
 
 interface AccountDetailsProps {

[Survived] ConditionalExpression
t485/src/pages/account.tsx:11:42
 
 const UpdateDisplayNameForm = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
-  const [name, setName] = React.useState(user?.displayName || "Loading...")
+  const [name, setName] = React.useState(true)
   if (!user) return <></>
 

[Survived] ConditionalExpression
t485/src/pages/account.tsx:11:42
 
 const UpdateDisplayNameForm = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
-  const [name, setName] = React.useState(user?.displayName || "Loading...")
+  const [name, setName] = React.useState(false)
   if (!user) return <></>
 

[Survived] ConditionalExpression
t485/src/pages/account.tsx:12:7
 const UpdateDisplayNameForm = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
   const [name, setName] = React.useState(user?.displayName || "Loading...")
-  if (!user) return <></>
+  if (false) return <></>
 
   const handleSubmit = (): void => {

[Survived] ConditionalExpression
t485/src/pages/account.tsx:12:7
 const UpdateDisplayNameForm = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
   const [name, setName] = React.useState(user?.displayName || "Loading...")
-  if (!user) return <></>
+  if (true) return <></>
 
   const handleSubmit = (): void => {

[Survived] BlockStatement
t485/src/pages/account.tsx:14:36
   const [name, setName] = React.useState(user?.displayName || "Loading...")
   if (!user) return <></>
 
-  const handleSubmit = (): void => {
-    user
-      .updateProfile({
-        displayName: name,
-        // photoURL: "https://example.com/jane-q-user/profile.jpg"
-      })
-      .then(function() {
-        console.log("DONE")
-      })
-      .catch(function(error) {
-        console.log(error)
-      })
-  }
+  const handleSubmit = (): void => {}
 }
 

[Survived] ObjectLiteral
t485/src/pages/account.tsx:16:22
 
   const handleSubmit = (): void => {
     user
-      .updateProfile({
-        displayName: name,
-        // photoURL: "https://example.com/jane-q-user/profile.jpg"
-      })
+      .updateProfile({})
       .then(function() {
         console.log("DONE")

[Survived] BlockStatement
t485/src/pages/account.tsx:20:24
         displayName: name,
         // photoURL: "https://example.com/jane-q-user/profile.jpg"
       })
-      .then(function() {
-        console.log("DONE")
-      })
+      .then(function() {})
       .catch(function(error) {
         console.log(error)

[Survived] StringLiteral
t485/src/pages/account.tsx:21:21
         // photoURL: "https://example.com/jane-q-user/profile.jpg"
       })
       .then(function() {
-        console.log("DONE")
+        console.log("")
       })
       .catch(function(error) {

[Survived] BlockStatement
t485/src/pages/account.tsx:23:30
       .then(function() {
         console.log("DONE")
       })
-      .catch(function(error) {
-        console.log(error)
-      })
+      .catch(function(error) {})
   }
 }

[Survived] ConditionalExpression
t485/src/pages/account.tsx:53:50
   onEditableChange,
   userData,
 }: AccountDetailsProps): ReactElement => {
-  const [newEmail, setNewEmail] = React.useState(userData.email || "")
+  const [newEmail, setNewEmail] = React.useState(true)
   const [newPassword, setNewPassword] = React.useState("")
 

[Survived] LogicalOperator
t485/src/pages/account.tsx:53:65
   onEditableChange,
   userData,
 }: AccountDetailsProps): ReactElement => {
-  const [newEmail, setNewEmail] = React.useState(userData.email || "")
+  const [newEmail, setNewEmail] = React.useState(userData.email && "")
   const [newPassword, setNewPassword] = React.useState("")
 

[Survived] ObjectLiteral
t485/src/pages/account.tsx:63:22
   const [changes, setChanges]: [
     ChangeMap,
     Dispatch<SetStateAction<ChangeMap>>
-  ] = React.useState({
-    any: false,
-    email: false,
-    password: false,
-  })
+  ] = React.useState({})
   React.useEffect(() => {
     const newChanges: Partial<ChangeMap> = {}

[Survived] BooleanLiteral
t485/src/pages/account.tsx:64:10
     ChangeMap,
     Dispatch<SetStateAction<ChangeMap>>
   ] = React.useState({
-    any: false,
+    any: true,
     email: false,
     password: false,

[Survived] BooleanLiteral
t485/src/pages/account.tsx:65:12
     Dispatch<SetStateAction<ChangeMap>>
   ] = React.useState({
     any: false,
-    email: false,
+    email: true,
     password: false,
   })

[Survived] BooleanLiteral
t485/src/pages/account.tsx:66:15
   ] = React.useState({
     any: false,
     email: false,
-    password: false,
+    password: true,
   })
   React.useEffect(() => {

[Survived] BlockStatement
t485/src/pages/account.tsx:68:25
     email: false,
     password: false,
   })
-  React.useEffect(() => {
-    const newChanges: Partial<ChangeMap> = {}
-    newChanges.email = newEmail !== userData.email
-    newChanges.password = newPassword !== ""
-    newChanges.any = false
-    Object.keys(newChanges).forEach(function(key) {
-      if (key == "any") return
-      if (newChanges[key]) newChanges.any = true
-    })
-    setChanges(newChanges)
-  }, [newEmail, newPassword])
+  React.useEffect(() => {}, [newEmail, newPassword])
 
   return (

[Survived] ConditionalExpression
t485/src/pages/account.tsx:70:24
   })
   React.useEffect(() => {
     const newChanges: Partial<ChangeMap> = {}
-    newChanges.email = newEmail !== userData.email
+    newChanges.email = false
     newChanges.password = newPassword !== ""
     newChanges.any = false

[Survived] ConditionalExpression
t485/src/pages/account.tsx:70:24
   })
   React.useEffect(() => {
     const newChanges: Partial<ChangeMap> = {}
-    newChanges.email = newEmail !== userData.email
+    newChanges.email = true
     newChanges.password = newPassword !== ""
     newChanges.any = false

[Survived] ConditionalExpression
t485/src/pages/account.tsx:71:27
   React.useEffect(() => {
     const newChanges: Partial<ChangeMap> = {}
     newChanges.email = newEmail !== userData.email
-    newChanges.password = newPassword !== ""
+    newChanges.password = true
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {

[Survived] EqualityOperator
t485/src/pages/account.tsx:71:39
   React.useEffect(() => {
     const newChanges: Partial<ChangeMap> = {}
     newChanges.email = newEmail !== userData.email
-    newChanges.password = newPassword !== ""
+    newChanges.password = newPassword === ""
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {

[Survived] BooleanLiteral
t485/src/pages/account.tsx:72:22
     const newChanges: Partial<ChangeMap> = {}
     newChanges.email = newEmail !== userData.email
     newChanges.password = newPassword !== ""
-    newChanges.any = false
+    newChanges.any = true
     Object.keys(newChanges).forEach(function(key) {
       if (key == "any") return

[Survived] BlockStatement
t485/src/pages/account.tsx:73:51
     newChanges.email = newEmail !== userData.email
     newChanges.password = newPassword !== ""
     newChanges.any = false
-    Object.keys(newChanges).forEach(function(key) {
-      if (key == "any") return
-      if (newChanges[key]) newChanges.any = true
-    })
+    Object.keys(newChanges).forEach(function(key) {})
     setChanges(newChanges)
   }, [newEmail, newPassword])

[Survived] ConditionalExpression
t485/src/pages/account.tsx:74:11
     newChanges.password = newPassword !== ""
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {
-      if (key == "any") return
+      if (true) return
       if (newChanges[key]) newChanges.any = true
     })

[Survived] ConditionalExpression
t485/src/pages/account.tsx:74:11
     newChanges.password = newPassword !== ""
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {
-      if (key == "any") return
+      if (false) return
       if (newChanges[key]) newChanges.any = true
     })

[Survived] ConditionalExpression
t485/src/pages/account.tsx:75:11
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {
       if (key == "any") return
-      if (newChanges[key]) newChanges.any = true
+      if (false) newChanges.any = true
     })
     setChanges(newChanges)

[Survived] ConditionalExpression
t485/src/pages/account.tsx:75:11
     newChanges.any = false
     Object.keys(newChanges).forEach(function(key) {
       if (key == "any") return
-      if (newChanges[key]) newChanges.any = true
+      if (true) newChanges.any = true
     })
     setChanges(newChanges)

[Survived] ArrowFunction
t485/src/pages/account.tsx:81:21
   }, [newEmail, newPassword])
 
   return (
-    <Form onSubmit={(e): void => e.preventDefault()}>
+    <Form onSubmit={() => undefined}>
       <Table>
         <tbody>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:87:16
           <tr>
             <th>Full Name</th>
             <td>
-              {userData.displayName || "Not Set"}
+              {true}
               {editable && (
                 <b>

[Survived] LogicalOperator
t485/src/pages/account.tsx:87:37
           <tr>
             <th>Full Name</th>
             <td>
-              {userData.displayName || "Not Set"}
+              {userData.displayName && "Not Set"}
               {editable && (
                 <b>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:88:16
             <th>Full Name</th>
             <td>
               {userData.displayName || "Not Set"}
-              {editable && (
-                <b>
-                  {" "}
-                  (Please contact the webmaster to change your account name)
-                </b>
-              )}
+              {true}
             </td>
           </tr>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:88:16
             <th>Full Name</th>
             <td>
               {userData.displayName || "Not Set"}
-              {editable && (
-                <b>
-                  {" "}
-                  (Please contact the webmaster to change your account name)
-                </b>
-              )}
+              {false}
             </td>
           </tr>

[Survived] StringLiteral
t485/src/pages/account.tsx:90:20
               {userData.displayName || "Not Set"}
               {editable && (
                 <b>
-                  {" "}
+                  {""}
                   (Please contact the webmaster to change your account name)
                 </b>

[Survived] ArrowFunction
t485/src/pages/account.tsx:103:29
                 <Form.Control
                   placeholder="Enter a new email"
                   value={newEmail}
-                  onChange={(e): void => setNewEmail(e.target.value)}
+                  onChange={() => undefined}
                   autoComplete="new-email"
                 />

[Survived] LogicalOperator
t485/src/pages/account.tsx:107:35
                   autoComplete="new-email"
                 />
               ) : (
-                <>{userData.email || "Not Set"}</>
+                <>{userData.email && "Not Set"}</>
               )}
             </td>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:107:20
                   autoComplete="new-email"
                 />
               ) : (
-                <>{userData.email || "Not Set"}</>
+                <>{false}</>
               )}
             </td>

[Survived] ArrowFunction
t485/src/pages/account.tsx:119:29
                   placeholder="Enter a new password..."
                   type="password"
                   value={newPassword}
-                  onChange={(e): void => setNewPassword(e.target.value)}
+                  onChange={() => undefined}
                   autoComplete="new-password"
                 />

[Survived] BooleanLiteral
t485/src/pages/account.tsx:124:60
                 />
               ) : (
                 <>
-                  <a onClick={(): void => onEditableChange(true)}>
+                  <a onClick={(): void => onEditableChange(false)}>
                     Enter editing mode
                   </a>{" "}

[Survived] ArrowFunction
t485/src/pages/account.tsx:124:31
                 />
               ) : (
                 <>
-                  <a onClick={(): void => onEditableChange(true)}>
+                  <a onClick={() => undefined}>
                     Enter editing mode
                   </a>{" "}

[Survived] ConditionalExpression
t485/src/pages/account.tsx:132:12
               )}
             </td>
           </tr>
-          {editable && changes.password && (
-            <tr>
-              <th>Confirm New Password</th>
-              <td>
-                {editable ? (
-                  <Form.Control
-                    placeholder="Confirm Password"
-                    type="password"
-                    value={newPassword}
-                    onChange={(e): void => setNewPassword(e.target.value)}
-                    autoComplete="new-password"
-                  />
-                ) : (
-                  <>
-                    <a onClick={(): void => onEditableChange(true)}>
-                      Enter editing mode
-                    </a>{" "}
-                    to change your password
-                  </>
-                )}
-              </td>
-            </tr>
-          )}
+          {false}
           <tr>
             <th>Sign in with google</th>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:132:12
               )}
             </td>
           </tr>
-          {editable && changes.password && (
+          {false && (
             <tr>
               <th>Confirm New Password</th>

[Survived] LogicalOperator
t485/src/pages/account.tsx:163:17
           </tr>
         </tbody>
       </Table>
-      {editable && (
+      {editable || (
         <>
           {changes.any && (

[Survived] ConditionalExpression
t485/src/pages/account.tsx:165:12
       </Table>
       {editable && (
         <>
-          {changes.any && (
-            <div>
-              <h3>Summary of your unsaved changes</h3>
-              <ul>
-                {changes.password && <li>Password changed</li>}
-                {changes.email && (
-                  <li>
-                    Email changed from {userData.email} to <b>{newEmail}</b>
-                  </li>
-                )}
-              </ul>
-            </div>
-          )}
+          {true}
           <Button variant="danger" className="">
             Cancel

[Survived] ConditionalExpression
t485/src/pages/account.tsx:165:12
       </Table>
       {editable && (
         <>
-          {changes.any && (
-            <div>
-              <h3>Summary of your unsaved changes</h3>
-              <ul>
-                {changes.password && <li>Password changed</li>}
-                {changes.email && (
-                  <li>
-                    Email changed from {userData.email} to <b>{newEmail}</b>
-                  </li>
-                )}
-              </ul>
-            </div>
-          )}
+          {false}
           <Button variant="danger" className="">
             Cancel

[Survived] ConditionalExpression
t485/src/pages/account.tsx:169:18
             <div>
               <h3>Summary of your unsaved changes</h3>
               <ul>
-                {changes.password && <li>Password changed</li>}
+                {false}
                 {changes.email && (
                   <li>

[Survived] LogicalOperator
t485/src/pages/account.tsx:169:35
             <div>
               <h3>Summary of your unsaved changes</h3>
               <ul>
-                {changes.password && <li>Password changed</li>}
+                {changes.password || <li>Password changed</li>}
                 {changes.email && (
                   <li>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:170:18
               <h3>Summary of your unsaved changes</h3>
               <ul>
                 {changes.password && <li>Password changed</li>}
-                {changes.email && (
-                  <li>
-                    Email changed from {userData.email} to <b>{newEmail}</b>
-                  </li>
-                )}
+                {true}
               </ul>
             </div>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:170:18
               <h3>Summary of your unsaved changes</h3>
               <ul>
                 {changes.password && <li>Password changed</li>}
-                {changes.email && (
-                  <li>
-                    Email changed from {userData.email} to <b>{newEmail}</b>
-                  </li>
-                )}
+                {false}
               </ul>
             </div>

[Survived] BooleanLiteral
t485/src/pages/account.tsx:184:23
           <Button
             variant="primary"
             className="float-right"
-            disabled={!changes.any}
+            disabled={changes.any}
           >
             {changes.any ? "Save Changes" : "No changes to save"}

[Survived] StringLiteral
t485/src/pages/account.tsx:186:45
             className="float-right"
             disabled={!changes.any}
           >
-            {changes.any ? "Save Changes" : "No changes to save"}
+            {changes.any ? "Save Changes" : ""}
           </Button>
         </>

[Survived] StringLiteral
t485/src/pages/account.tsx:186:28
             className="float-right"
             disabled={!changes.any}
           >
-            {changes.any ? "Save Changes" : "No changes to save"}
+            {changes.any ? "" : "No changes to save"}
           </Button>
         </>

[Survived] BlockStatement
t485/src/pages/account.tsx:193:41
     </Form>
   )
 }
-const AccountPage = (): ReactElement => {
-  const [user, loading, error] = useAuthState(firebase.auth())
-  const [editable, setEditable] = React.useState(false)
-  return (
-    <Layout>
-      <SEO title="Your Account" />
-      <h1>Your Account</h1>
-      <p>Hello, {user?.displayName || user?.email}!</p>
-      <p>Your Name: {user?.displayName}</p>
-      <a onClick={(): void => setEditable(old => !old)}>
-        {editable ? "Cancel Editing (don't save changes)" : "Edit"}
-      </a>
-      {user && (
-        <AccountDetails
-          editable={editable}
-          onEditableChange={(value): void => setEditable(value)}
-          userData={user}
-        />
-      )}
-    </Layout>
-  )
-}
+const AccountPage = (): ReactElement => {}
 
 export default AccountPage

[Survived] BooleanLiteral
t485/src/pages/account.tsx:195:50
 }
 const AccountPage = (): ReactElement => {
   const [user, loading, error] = useAuthState(firebase.auth())
-  const [editable, setEditable] = React.useState(false)
+  const [editable, setEditable] = React.useState(true)
   return (
     <Layout>

[Survived] LogicalOperator
t485/src/pages/account.tsx:200:36
     <Layout>
       <SEO title="Your Account" />
       <h1>Your Account</h1>
-      <p>Hello, {user?.displayName || user?.email}!</p>
+      <p>Hello, {user?.displayName && user?.email}!</p>
       <p>Your Name: {user?.displayName}</p>
       <a onClick={(): void => setEditable(old => !old)}>

[Survived] ConditionalExpression
t485/src/pages/account.tsx:200:18
     <Layout>
       <SEO title="Your Account" />
       <h1>Your Account</h1>
-      <p>Hello, {user?.displayName || user?.email}!</p>
+      <p>Hello, {false}!</p>
       <p>Your Name: {user?.displayName}</p>
       <a onClick={(): void => setEditable(old => !old)}>

[Survived] ArrowFunction
t485/src/pages/account.tsx:202:43
       <h1>Your Account</h1>
       <p>Hello, {user?.displayName || user?.email}!</p>
       <p>Your Name: {user?.displayName}</p>
-      <a onClick={(): void => setEditable(old => !old)}>
+      <a onClick={(): void => setEditable(() => undefined)}>
         {editable ? "Cancel Editing (don't save changes)" : "Edit"}
       </a>

[Survived] ArrowFunction
t485/src/pages/account.tsx:202:19
       <h1>Your Account</h1>
       <p>Hello, {user?.displayName || user?.email}!</p>
       <p>Your Name: {user?.displayName}</p>
-      <a onClick={(): void => setEditable(old => !old)}>
+      <a onClick={() => undefined}>
         {editable ? "Cancel Editing (don't save changes)" : "Edit"}
       </a>

[Survived] StringLiteral
t485/src/pages/account.tsx:203:21
       <p>Hello, {user?.displayName || user?.email}!</p>
       <p>Your Name: {user?.displayName}</p>
       <a onClick={(): void => setEditable(old => !old)}>
-        {editable ? "Cancel Editing (don't save changes)" : "Edit"}
+        {editable ? "" : "Edit"}
       </a>
       {user && (

[Survived] ConditionalExpression
t485/src/pages/account.tsx:205:8
       <a onClick={(): void => setEditable(old => !old)}>
         {editable ? "Cancel Editing (don't save changes)" : "Edit"}
       </a>
-      {user && (
-        <AccountDetails
-          editable={editable}
-          onEditableChange={(value): void => setEditable(value)}
-          userData={user}
-        />
-      )}
+      {false}
     </Layout>
   )

[Survived] LogicalOperator
t485/src/pages/account.tsx:205:13
       <a onClick={(): void => setEditable(old => !old)}>
         {editable ? "Cancel Editing (don't save changes)" : "Edit"}
       </a>
-      {user && (
+      {user || (
         <AccountDetails
           editable={editable}

[Survived] ArrowFunction
t485/src/pages/account.tsx:208:29
       {user && (
         <AccountDetails
           editable={editable}
-          onEditableChange={(value): void => setEditable(value)}
+          onEditableChange={() => undefined}
           userData={user}
         />
