[Survived] BooleanLiteral
src/pages/account/logout.tsx:17:13
     Error,
     React.Dispatch<React.SetStateAction<Error>>
   ] = React.useState({
-    exists: false,
+    exists: true,
   })
   const [loading, setLoading] = React.useState(true)

[Survived] BooleanLiteral
src/pages/account/logout.tsx:19:48
   ] = React.useState({
     exists: false,
   })
-  const [loading, setLoading] = React.useState(true)
+  const [loading, setLoading] = React.useState(false)
   firebase
     .auth()

[Survived] BlockStatement
src/pages/account/logout.tsx:23:17
   firebase
     .auth()
     .signOut()
-    .then(() => {
-      setLoading(false)
-    })
+    .then(() => {})
     .catch((e: Error) => {
       setError(e)

[Survived] BooleanLiteral
src/pages/account/logout.tsx:24:18
     .auth()
     .signOut()
     .then(() => {
-      setLoading(false)
+      setLoading(true)
     })
     .catch((e: Error) => {

[Survived] BlockStatement
src/pages/account/logout.tsx:26:26
     .then(() => {
       setLoading(false)
     })
-    .catch((e: Error) => {
-      setError(e)
-    })
+    .catch((e: Error) => {})
   return (
     <Layout>

[Survived] StringLiteral
src/pages/account/logout.tsx:38:13
           ? "Logging you out. Please wait..."
           : error.exists
           ? error.message
-          : "You have been logged out successfully"}
+          : ""}
       </p>
     </Layout>
