[Survived] ObjectLiteral
t485/src/pages/index.tsx:40:18
         <Img
           fluid={data.bgImage.childImageSharp.fluid}
           className="h-screen"
-          style={{ minHeight: "800px" }}
+          style={{}}
         />
       </div>

[Survived] StringLiteral
t485/src/pages/index.tsx:40:31
         <Img
           fluid={data.bgImage.childImageSharp.fluid}
           className="h-screen"
-          style={{ minHeight: "800px" }}
+          style={{ minHeight: "" }}
         />
       </div>
